app/controllers/bands_controller.rb

    def create
      #debugger
      if params[:band][:password] == "password"
        @band = Band.new(name: params[:band][:name], bio: params[:band][:bio], location: params[:band][:location], website: params[:band][:website], donate_link: params[:band][:donate_link])
        if @band.save
---
INSERT INTO "bands" ("name", "bio", "location", "website", "donate_link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "me"], ["bio", ""], ["location", ""], ["website", ""], ["donate_link", ""], ["created_at", "2016-02-06 23:37:51.753695"], ["updated_at", "2016-02-06 23:37:51.753695"]]