app/controllers/pages_controller.rb

SELECT "bands".* FROM "bands"
---
    def voting
        @list = Band.all